# Taps
tap 'argoproj/tap'
tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'nicoverbruggen/homebrew-cask'
tap 'stripe/stripe-cli'
tap 'puma/puma'
tap 'kajabi/kjctl', 'git@github.com:Kajabi/kjctl.git'

# Core
brew 'asdf' # Version manager
brew 'bat' # Cat with wings
brew 'coreutils' # macOS are outdated
brew 'curl' # Curl
brew 'diff-so-fancy' # Better diff
brew 'direnv' # Environment switcher
brew 'eza' # Ls with colors
brew 'git' # Git
brew 'git-delta' # Better diff for git
brew 'glow' # Markdown reader
brew 'golang' # Go
brew 'gpg' # GPG
brew 'htop' # Better top
brew 'hub' # Github CLI
brew 'imagemagick' # ImageMagick
brew 'jq' # JSON processor
brew 'mas' # Mac App Store CLI
brew 'mcfly' # Better history
brew 'mkcert' # Local SSL
brew 'python' # Python
brew 'reattach-to-user-namespace' # Tmux copy paste
brew 'ripgrep' # Ripgrep
brew 'ripgrep-all' # Ripgrep all
brew 'tfenv' # Terraform version manager
brew 'tmux' # Tmux
brew 'tmuxinator' # Tmux profiles
brew 'vault' # Vault
brew 'yamllint' # YAML linter
brew 'wget' # Wget
brew 'zsh' # Zsh

# Fonts
cask 'font-3270-nerd-font'
cask 'font-agave-nerd-font'
cask 'font-anonymice-nerd-font'
cask 'font-arimo-nerd-font'
cask 'font-aurulent-sans-mono-nerd-font'
cask 'font-awesome-terminal-fonts'  # Font Awesome for terminal
cask 'font-bigblue-terminal-nerd-font'
cask 'font-bitstream-vera-sans-mono-nerd-font'
cask 'font-blex-mono-nerd-font'
cask 'font-caskaydia-cove-nerd-font'
cask 'font-code-new-roman-nerd-font'
cask 'font-cousine-nerd-font'
cask 'font-daddy-time-mono-nerd-font'
cask 'font-dejavu-sans-mono-nerd-font'
cask 'font-droid-sans-mono-nerd-font'
cask 'font-fantasque-sans-mono-nerd-font'
cask 'font-fira-code' # Fira Code font
cask 'font-fira-code-nerd-font'
cask 'font-fira-mono-nerd-font'
cask 'font-go-mono-nerd-font'
cask 'font-gohufont-nerd-font'
cask 'font-hack-nerd-font'
cask 'font-hasklug-nerd-font'
cask 'font-heavy-data-nerd-font'
cask 'font-hurmit-nerd-font'
cask 'font-im-writing-nerd-font'
cask 'font-inconsolata-go-nerd-font'
cask 'font-inconsolata-lgc-nerd-font'
cask 'font-inconsolata-nerd-font'
cask 'font-iosevka-nerd-font'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-lekton-nerd-font'
cask 'font-liberation-nerd-font'
cask 'font-meslo-lg-nerd-font'
cask 'font-monofur-nerd-font'
cask 'font-monoid-nerd-font'
cask 'font-mononoki-nerd-font'
cask 'font-mplus-nerd-font'
cask 'font-noto-nerd-font'
cask 'font-open-dyslexic-nerd-font'
cask 'font-overpass-nerd-font'
cask 'font-profont-nerd-font'
cask 'font-proggy-clean-tt-nerd-font'
cask 'font-roboto-mono-nerd-font'
cask 'font-sauce-code-pro-nerd-font'
cask 'font-shure-tech-mono-nerd-font'
cask 'font-space-mono-nerd-font'
cask 'font-terminess-ttf-nerd-font'
cask 'font-tinos-nerd-font'
cask 'font-ubuntu-mono-nerd-font'
cask 'font-ubuntu-nerd-font'
cask 'font-victor-mono-nerd-font'
cask 'homebrew/cask-fonts/font-fontawesome' # Font Awesome

# Apps
cask '1password' # 1Password
cask 'adobe-creative-cloud' # Adobe Creative Cloud
cask 'brave-browser' # Brave Browser
cask 'caffeine' # Caffeine
cask 'dash' # Dash
cask 'docker' # Docker
cask 'github' # Github Desktop
cask 'imageoptim' # Optimize images # Rest client
cask 'iterm2' # iTerm2
cask 'numi' # Calculator
cask 'plex' # Plex
cask 'spotify' # Spotify
cask 'the-unarchiver' # Unarchiver
cask 'visual-studio-code' # VSCode
cask 'obsidian' # Obsidian
cask 'wireshark'# Wireshark
cask 'shottr' # Screenshot

# Mac Apple Store
# https://github.com/mas-cli/mas/issues/498
# mas 'iBar-Menubar icon control tool', id: '-2146090692' # Menubar icon control
mas 'Boop', id: 1518425043 # Various developer tools
mas 'Clipboard Manager - PastePal', id: 1503446680 # Clipboard manager
mas 'ColorSlurp', id: 1287239339 # Color picker
mas 'Magnet', id: 441258766 # Window manager
mas 'MindNode - Mind Map & Outline', id: 1289197285 # Brain Map
mas 'Trello', id: 1278508951 # Trello
mas 'Noizio - Calm, Meditate, Sleep', id: 928871589 # White Noise

# VSCode extensions
vscode 'deerawan.vscode-dash' # Dash
vscode 'github.copilot' # Copilot
vscode 'github.copilot-chat' # Copilot chat
vscode 'golang.go' # Go
vscode 'johnpapa.vscode-peacock' # Peacock
vscode 'yoavbls.pretty-ts-errors' # Pretty TS errors
vscode 'ivhernandez.vscode-plist' # PList Editor
vscode 'britesnow.vscode-toggle-quotes' # Toggle quotes
vscode 'vscodevim.vim' # Vim
vscode 'sharashchandradesai.simple-scratch' # Scratch Pads
vscode 'ms-azuretools.vscode-docker' # Docker
vscode 'ms-vscode-remote.remote-containers' # Remote containers
vscode 'dbaeumer.vscode-eslint' # ESLint
vscode 'christian-kohler.npm-intellisense' # NPM Intellisense
vscode 'ms-kubernetes-tools.vscode-kubernetes-tools' # Kubernetes
vscode 'esbenp.prettier-vscode' # Prettier
vscode 'nguyenngoclong.asdf' # ASDF
vscode 'vortizhe.simple-ruby-erb' # Ruby ERB
vscode 'irongeek.vscode-env' # .env
